Repository: karlsbjorn/vrt-cogs
Catalog: tickets/locales/*.po
Languages: de_de, fr_fr

source: You are not allowed to interact with this button.
de_de: Es ist nicht erlaubt, mit dieser Schaltfläche zu interagieren.
fr_fr: Vous n'êtes pas autorisé à interagir avec ce bouton.

source: Support ticket system with multi-panel functionality
de_de: Support-Ticket-System mit Multi-Panel-Funktionalität
fr_fr: Système de support de tickets avec fonctionnalité multi-panels

source: No data to delete
de_de: Keine Daten zu löschen
fr_fr: Aucune donnée à supprimer

source: If you do not respond to this ticket within the next 20 minutes it will be closed automatically.
de_de: Wenn Sie nicht innerhalb der nächsten 20 Minuten auf dieses Ticket reagieren, wird es automatisch geschlossen.
fr_fr: Si vous ne répondez pas à ce billet dans les 20 prochaines minutes, il sera fermé automatiquement.

source: (Auto-Close) Opened ticket with no response for
de_de: (Auto-Close) Geöffnetes Ticket ohne Antwort für
fr_fr: (Clôture automatique) Billet ouvert sans réponse pendant

source: User left guild(Auto-Close)
de_de: Benutzer hat Gilde verlassen (Auto-Close)
fr_fr: L'utilisateur a quitté la guilde (Fermeture automatique)

source: I am missing the `Manage Channels` permission to close this ticket!
de_de: Ich vermisse die Berechtigung `Kanäle verwalten`, um dieses Ticket zu schließen!
fr_fr: Il me manque l'autorisation de « Gérer les canaux » pour fermer ce ticket !

source: I am missing the `Manage Threads` permission to close this ticket!
de_de: Ich vermisse die `Manage Threads` Berechtigung, um dieses Ticket zu schließen!
fr_fr: Il me manque l'autorisation «Gérer les threads» pour fermer ce ticket !

source: Ticket created by **{}-{}** has been closed. `PanelType: `{} `Opened on: `<t:{}:F> `Closed on: `<t:{}:F> `Closed by: `{} `Reason: `{}
de_de: Das von **{}-{}** erstellte Ticket wurde geschlossen. `PanelType: `{} `Geöffnet am: `<t:{}:F> `Geschlossen am: `<t:{}:F> `Geschlossen von: `{} `Grund: `{}
fr_fr: Le billet créé par **{}-{}** a été fermé. `PanelType: {}` `Ouvert le: <t:{}:F>` `Fermé le: <t:{}:F>` `Fermé par: {}` `Raison: {}`

source: Ticket Closed {} Currently missing permissions to send embeds to this channel!
de_de: Ticket geschlossen {} Derzeit fehlen die Berechtigungen, um Einbettungen an diesen Kanal zu senden!
fr_fr: Billet fermé {} Autorisations actuellement manquantes pour envoyer des intégrations à cette chaîne !

source: Ticket Closed
de_de: Ticket geschlossen
fr_fr: Billet fermé

source: Archiving channel...
de_de: Archivierungskanal...
fr_fr: Archivage du canal...

source: This channel will be deleted once complete
de_de: Dieser Kanal wird nach Fertigstellung gelöscht
fr_fr: Ce canal sera supprimé une fois terminé

source: Question: {} Response: {}
de_de: Frage: {} Antwort: {}
fr_fr: Question: {} Réponse: {}

source: Files uploaded:
de_de: Hochgeladene Dateien:
fr_fr: Fichiers téléchargés:

source: There are no tickets stored in the database.
de_de: Es sind keine Tickets in der Datenbank gespeichert.
fr_fr: Il n'y a pas de billets stockés dans la base de données.

source: ticket
fr_fr: billet

source: tickets
de_de: eintrittskarten
fr_fr: des billets

source: Pruned `{}` invalid {}
de_de: Ungültige `{}` entfernt {}
fr_fr: Taillé `{}` invalide {}

source: There are no tickets to prune
de_de: Es gibt keine Tickets zum Beschneiden
fr_fr: Il n'y a pas de billets à élaguer

source: Ticket Overview
de_de: Ticket-Übersicht
fr_fr: Aperçu des billets

source: There are no active tickets.
de_de: Es gibt keine aktiven Tickets.
fr_fr: Il n'y a pas de billets actifs.

source: Update active ticket overview Args: guild (discord.Guild): discord server conf (dict): settings for the guild Returns: int: Message ID of the overview panel
de_de: Aktualisiere die Übersicht der aktiven Tickets Argumente: guild (discord.Guild): Discord-Server conf (dict): Einstellungen für den Server Rückgabe: int: Nachrichten-ID des Übersichtsfensters
fr_fr: Mettre à jour la vue d'ensemble des billets actifs Args: guild (discord.Guild): serveur Discord conf (dict): paramètres pour la guilde Retour: int: ID du message du panneau d'aperçu

source: cancel
de_de: kündigen
fr_fr: Annuler

source: Closing your ticket
de_de: Ihr Ticket schließen
fr_fr: Clôture de votre billet

source: Reason for closing
de_de: Grund für die Schließung
fr_fr: Raison de la clôture

source: You do not have permissions to close this ticket
de_de: Sie haben keine Berechtigung, dieses Ticket zu schließen
fr_fr: Vous n'avez pas d'autorisations pour fermer ce billet

source: Closing...
de_de: Schließen...
fr_fr: Fermeture...

source: You been blacklisted from creating tickets!
de_de: Sie wurden von der Erstellung von Tickets ausgeschlossen!
fr_fr: Vous avez été mis sur liste noire de la création de billets !

source: You have a role that has been blacklisted from creating tickets!
de_de: Sie haben eine Rolle, die auf der schwarzen Liste für die Erstellung von Tickets steht!
fr_fr: Vous avez un rôle qui a été mis sur liste noire de la création de billets !

source: You must have one of the following roles to open this ticket:
de_de: Sie müssen eine der folgenden Rollen haben, um dieses Ticket zu öffnen:
fr_fr: Vous devez avoir l'un des rôles suivants pour ouvrir ce billet :

source: You have the maximum amount of tickets opened already!{}
fr_fr: Vous avez déjà ouvert le nombre maximum de billets!{}

source: The category for this support panel cannot be found! please contact an admin!
de_de: Die Kategorie für dieses Support-Panel kann nicht gefunden werden! Bitte kontaktieren Sie einen Administrator!
fr_fr: La catégorie de ce panneau de support ne peut pas être trouvée ! Veuillez contacter un administrateur !

source: Submission Info
de_de: Informationen zur Einreichung
fr_fr: Informations sur la soumission

source: Unanswered
de_de: Unbeantwortet
fr_fr: Sans réponse

source: Your ticket is being created, one moment...
de_de: Ihr Ticket wird gerade erstellt, einen Moment...
fr_fr: Votre billet est en train d'être créé, à un moment...

source: {} ticket for {}
de_de: {} Ticket für {}
fr_fr: {} ticket pour {}

source: I am missing the required permissions to create a ticket for you. Please contact an admin so they may fix my permissions.
de_de: Ich habe nicht die erforderlichen Berechtigungen, um ein Ticket für Sie zu erstellen. Bitte kontaktieren Sie einen Administrator, damit er meine Berechtigungen korrigieren kann.
fr_fr: Je n'ai pas les autorisations nécessaires pour créer un ticket pour vous. Veuillez contacter un administrateur afin qu'il puisse corriger mes autorisations.

source: There was an error while preparing your ticket, please contact an admin! {}
de_de: Bei der Vorbereitung Ihres Tickets ist ein Fehler aufgetreten, bitte kontaktieren Sie einen Administrator! {}
fr_fr: Il y a eu une erreur lors de la préparation de votre billet, veuillez contacter un administrateur ! {}

source: Welcome to your ticket channel
de_de: Willkommen in Ihrem Ticket-Kanal
fr_fr: Bienvenue dans votre chaîne de billets

source: You or an admin can close this with the `{}close` command
de_de: Sie oder ein Administrator können dies mit dem Befehl `{}close` schließen
fr_fr: Vous ou un administrateur pouvez fermer cela avec la commande `{}close`

source: Ticket form questions
de_de: Fragen zum Ticketformular
fr_fr: Questions de formulaire de billets

source: I tried to pin the response message but don't have the manage messages permissions!
de_de: Ich habe versucht, die Antwortnachricht anzuheften, aber ich habe nicht die Berechtigung, Nachrichten zu verwalten!
fr_fr: J'ai essayé d'épingler le message de réponse mais je n'ai pas les autorisations de gestion des messages !

source: Your ticket has been created! {}
fr_fr: Votre billet a été créé ! {}

source: `Created By: `{user} `User ID: `{userid} `Opened: `{timestamp} `Ticket: `{channelname} `Panel Name: `{panelname} **[Click to Jump!]({jumpurl})**
de_de: `Erstellt von: `{user} `Benutzer-ID: `{userid} `Geöffnet am: `{timestamp} `Ticket: `{channelname} `Panel-Name: `{panelname} **[Hier klicken, um zu springen!]({jumpurl})**
fr_fr: `Créé par:` {utilisateur} `ID utilisateur:` {userId} `Ouvert:` {horodatage} `Ticket:` {ChannelName} `Nom du panneau:` {PannelName} **[Cliquez pour sauter!]({Jumpurl})**

source: Ticket Opened
de_de: Ticket geöffnet
fr_fr: Billet ouvert

source: You have already been added to the ticket **{}**!
de_de: Sie sind bereits zum Ticket **{}** hinzugefügt worden!
fr_fr: Vous avez déjà été ajouté au billet **{}** !

source: The maximum amount of staff have claimed this ticket!
de_de: Die maximale Anzahl von Mitarbeitern hat dieses Ticket beansprucht!
fr_fr: Le nombre maximum d'employés a réclamé ce ticket !

source: You already have access to the ticket **{}**!
de_de: Sie haben bereits Zugriff auf das Ticket **{}**!
fr_fr: Vous avez déjà accès au billet **{}** !

source: {} was added to the ticket
de_de: {} wurde dem Ticket hinzugefügt
fr_fr: {} a été ajouté au billet

source: You have been added to the ticket **{}**
de_de: Sie wurden zum Ticket **{}** hinzugefügt
fr_fr: Vous avez été ajouté au billet **{}**
