Repository: karlsbjorn/vrt-cogs
Catalog: levelup/shared/locales/*.po
Languages: es_es

source: Check if a user has leveled up and award roles if needed Args: guild (discord.Guild): The guild where the leveling up occurred. member (discord.Member): The member who leveled up. profile (Profile): The profile of the member. conf (GuildSettings): The guild settings. message (t.Optional[discord.Message], optional): The message that triggered the leveling up. Defaults to None. channel (t.Optional[t.Union[discord.TextChannel, discord.VoiceChannel, discord.Thread, discord.ForumChannel]], optional): The channel where the leveling up occurred. Defaults to None. Returns: Tuple[List[discord.Role], List[discord.Role]]: A tuple containing two lists of roles - the roles that were added and the roles that were removed.
es_es: Comprueba si un usuario ha subido de nivel y otorga roles si es necesario Argumentos: guild (discord.Guild): El servidor donde ocurrió el aumento de nivel. member (discord.Member): El miembro que subió de nivel. profile (Profile): El perfil del miembro. conf (GuildSettings): La configuración del servidor. message (t.Optional[discord.Message], optional): El mensaje que desencadenó el aumento de nivel. Por defecto es None. channel (t.Optional[t.Union[discord.TextChannel, discord.VoiceChannel, discord.Thread, discord.ForumChannel]], optional): El canal donde ocurrió el aumento de nivel. Por defecto es None. Retorna: Tupla[List[discord.Role], List[discord.Role]]: Una tupla que contiene dos listas de roles: los roles que fueron añadidos y los roles que fueron eliminados.

source: You just reached level {} in {} and obtained the {} role!
es_es: ¡Acabas de alcanzar el nivel {} en {} y obtuviste el rol {}!

source: {} just reached level {} and obtained the {} role!
es_es: ¡{} acaba de alcanzar el nivel {} y obtuvo el rol {}!

source: You just reached level {} in {}!
es_es: ¡Acabas de alcanzar el nivel {} en {}!

source: {} just reached level {}!
es_es: ¡{} acaba de alcanzar el nivel {}!

source: Ensure a user has the correct level roles based on their level and the guild's settings
es_es: Asegúrate de que un usuario tenga los roles de nivel correctos según su nivel y la configuración del servidor

source: Add XP to a user and check for level ups
es_es: Añade XP a un usuario y verifica si sube de nivel

source: Set a user's XP and check for level ups
es_es: Establece el XP de un usuario y verifica si sube de nivel

source: Remove XP from a user and check for level ups
es_es: Elimina XP de un usuario y verifica si sube de nivel

source: Get a background for a user's profile in the following priority: - Custom background selected by user - Banner of user's Discord profile - Random background
es_es: Obtén un fondo para el perfil de un usuario en la siguiente prioridad: - Fondo personalizado seleccionado por el usuario - Banner del perfil de Discord del usuario - Fondo aleatorio

source: Fetch a user's banner from Discord's API Args: user_id (int): The ID of the user Returns: t.Optional[str]: The URL of the user's banner image, or None if no banner is found
es_es: Obtén el banner de un usuario desde la API de Discord Argumentos: user_id (int): El ID del usuario Retorna: t.Optional[str]: La URL de la imagen del banner del usuario, o None si no se encuentra ningún banner

source: Get a user's profile as an embed or file If embed profiles are disabled, a file will be returned, otherwise an embed will be returned Args: member (discord.Member): The member to get the profile for reraise (bool, optional): Fetching profiles will normally catch almost all exceptions and try to handle them silently, this will make them throw an exception. Defaults to False. Returns: t.Union[discord.Embed, discord.File]: An embed or file containing the user's profile
es_es: Obtén el perfil de un usuario como un embed o archivo Si los perfiles embed están desactivados, se devolverá un archivo, de lo contrario, se devolverá un embed Argumentos: member (discord.Member): El miembro para obtener el perfil reraise (bool, opcional): Obtener perfiles normalmente captura casi todas las excepciones e intenta manejarlas de manera silenciosa, esto hará que lance una excepción. Por defecto es False. Retorna: t.Union[discord.Embed, discord.File]: Un embed o archivo que contiene el perfil del usuario

source: Level {}
es_es: Nivel {}

source: Prestige {}
es_es: Prestigio {}

source: stars
es_es: estrellas

source: messages sent
es_es: mensajes enviados

source: in voice
es_es: en voz

source: {}'s Profile
es_es: Perfil de {}

source: Rank {}, with {}% of the total server Exp
es_es: Rango {}, con el {}% del XP total del servidor

source: Progress
es_es: Progreso

source: Cached version of get_user_profile
es_es: Versión en caché de get_user_profile

source: Announce and reset weekly stats Args: guild (discord.Guild): The guild where the weekly stats are being reset. ctx (commands.Context, optional): Sends the announcement embed in the current channel. Defaults to None.
es_es: Anuncia y restablece las estadísticas semanales Argumentos: guild (discord.Guild): El servidor donde se están restableciendo las estadísticas semanales. ctx (commands.Context, opcional): Envía el embed de anuncio en el canal actual. Por defecto es None.

source: There are no users in the weekly data yet
es_es: Aún no hay usuarios en los datos semanales

source: There are no users with XP in the weekly data yet
es_es: Aún no hay usuarios con XP en los datos semanales

source: `Total Exp: `{} `Total Messages: `{} `Total Stars: `{} `Total Voicetime: `{} `Next Reset: `{}
es_es: `Total Exp: `{} `Total de Mensajes: `{} `Total de Estrellas: `{} `Total de Tiempo de voz: `{} `Próximo Reinicio: `{}

source: Top Weekly Exp Earners
es_es: Principales ganadores de experiencia semanal

source: `Experience: `{} `Messages: `{} `Stars: `{} `Voicetime: `{}
es_es: `Experiencia: `{} `Mensajes: `{} `Estrellas: `{} `Tiempo de voz: `{}

source: Missing permissions to manage roles
es_es: Faltan permisos para gestionar roles

source: Weekly winner role removal
es_es: Eliminación de roles de ganador semanal

source: Weekly winner role addition
es_es: Adición de roles de ganador semanal

source: Weekly stats have been reset.
es_es: Las estadísticas semanales han sido reiniciadas.
